# Квадратное уравнение. Пользователь вводит 3 коэффициента a, b и с.
# Программа вычисляет дискриминант (D) и корни уравнения (x1 и x2, если они есть) и выводит значения дискриминанта и корней на экран.
# При этом возможны следующие варианты:
#   Если D > 0, то выводим дискриминант и 2 корня
#   Если D = 0, то выводим дискриминант и 1 корень (т.к. корни в этом случае равны)
#   Если D < 0, то выводим дискриминант и сообщение "Корней нет"
# Подсказка: Алгоритм решения с блок-схемой (www.bolshoyvopros.ru). Для вычисления квадратного корня, нужно использовать 

p 'Введите 3 коэффициента квадратного уравнения через пробел'
a, b, c = gets.split().map{|str| str.to_f}

D = b**2 - 4 * a * c
if D > 0
  x1 = (-b + Math.sqrt(D)).to_f/(2 * a)
  x2 = (-b - Math.sqrt(D)).to_f/(2 * a)
  p x1, x2
elsif D == 0
  p (-b.to_f/(2 * a))
else
  p 'Корней нет'
end
